课();
setInterval('课()',1000);
function 课(){
    var 科 = [['早测','早读','日一','日二','日三','日四','日五','日读','日六','日七','划水','晚测','晚读','晚修','晚修'],
           	 ['早测','早读','班会','数学','数学','语文','语文','午读','物理','英语','卫生','晚测','晚读','晚修','晚修'],
          	 ['早测','早读','数学','英语','地理','化学','体育','午读','语文','物理','地理','晚测','晚读','晚修','晚修'],
          	 ['早测','早读','数学','语文','化学','地理','英语','午读','自习','物理','自习','晚测','晚读','晚修','晚修'],
          	 ['早测','早读','数学','英语','化学','物理','语文','午读','自习','地理','自习','晚测','晚读','晚修','晚修'],
          	 ['早测','早读','语文','英语','英语','物理','化学','午读','自习','数学','跑操','晚测','晚读','晚修','晚修'],
          	 ['早测','早读','六一','六二','六三','六四','六五','六学','入门','删库','跑路','晚溜','晚读','晚修','晚修']];
          
	var 六 = [['早测','早读','化学','英语','物理','数学','语文','休息','','','','自测','晚读','晚修','晚修'],
   			 ['早测','早读','数学','英语','语文','物理','地理','休息','','','','自测','晚读','晚修','晚修'],
          	 ['早测','早读','地理','英语','语文','化学','数学','休息','','','','自测','晚读','晚修','晚修']];
	var 日 = [['早测','早读','语文','语文','地理','数学','化学','午读','英语','物理','','晚测','晚读','晚修','晚修'],
   			 ['早测','早读','地理','物理','数学','数学','化学','午读','语文','英语','','晚测','晚读','晚修','晚修'],
          	 ['早测','早读','英语','英语','化学','语文','数学','午读','物理','地理','','晚测','晚读','晚修','晚修']];

	var 上 = ['06:40','07:00','07:25','08:15','09:05','10:05','10:55','14:30','14:40','15:30','16:20','18:40','19:10','19:40','21:00'];
	var 下 = ['07:00','07:20','08:05','08:45','09:45','10:45','11:35','14:40','15:20','16:10','17:00','19:10','19:30','20:50','22:15'];

    var 现 = new Date(/*'2020/11/21 08:30'*/);
    var 今 = 现.toLocaleDateString( );
    var 星 = 现.getDay();
	var 戳 = 现.getTime();
	var 轮 = Math.floor(戳/604800000%3);
	var	科 = 科[星];
    var 节 = 0;
    for(节 in 上){
        上[节] = new Date(今+' '+上[节]).getTime();
        下[节] = new Date(今+' '+下[节]).getTime();
    }
    
    if(星 == 6){
    	for(节 in 科){
        	科[节] = 六[轮][节];
    	}
    }else if(星 == 0){
        for(节 in 科){
        	科[节] = 日[轮][节];
    	}
    }

    function 判(){
        for(节 in 科){
            节 = parseInt(节);
            if(上[节] > 戳){
                return 0;
            }else if(上[节] <= 戳&戳 < 下[节]){
                return 1;
            }else if(下[下.length-1] <= 戳){
                return 2;
            }
        }
    }

    switch(判()){
    	case 0:
			var 分 = Math.floor((上[节]-戳)/60000);//if(分 < 10){分 = '0'+分};
		    var 秒 = Math.floor((上[节]-戳)/1000%60);if(秒 < 10){秒 = '0'+秒};
		    var 近 = 分+':'+秒;
	        	出 = 科[节];
	       		倒 = '倒 课 中';
	        	转 = '转 后 中';
	        if(分 < 10){
	            补 = 近;
	        }else{
	            补 = '下节';
 	       }
	    break;
	    case 1:
	        var 分 = Math.floor((下[节]-戳)/60000);//if(分 < 10){分 = '0'+分};
		    var 秒 = Math.floor((下[节]-戳)/1000%60);if(秒 < 10){秒 = '0'+秒};
			var 近 = 分+':'+秒;
	            出 = 科[节];
	            倒 = '课 中';
	        	转 = '后 中';
	        if(科[节+1]){
	            补 = 科[节+1];
	        }else{
	            补 = '放学';
	        }
	        if(分 < 5){
	            补 = 近;
	        }
	    break;
	    case 2:
	            出 = '晚安';
				补 = '撒花';
	            倒 = '课 中 满';
        		转 = '隐';
    	break;
    }
    document.getElementById('课').innerHTML=出;
    document.getElementById('后').innerHTML=补;
    document.getElementById('课').className=倒;
    document.getElementById('后').className=转;
}